.config/doom/config.org
#+TITLE: Lukas' Doom Emacs Config
#+AUTHOR: Lukas Lundmark
#+EMAIL: lukas.ludmark@foi.se
#+DESCRIPTION: Lukas' personal Doom Emacs config.
#+STARTUP: showeverything
#+PROPERTY: header-args :results silent :tangle config.el

* TABLE OF CONTENTS :toc:
- [[#about-this-config][ABOUT THIS CONFIG]]
- [[#misc][MISC]]
  - [[#add-extra-leader][Add Extra Leader]]
  - [[#words-in-emacs][WORDS in Emacs]]
  - [[#disabling-doom-theme-and-using-emacs-nano][Disabling Doom Theme and using Emacs NANO]]
  - [[#doom-theme][DOOM THEME]]
  - [[#auto-fill][AUTO-FILL]]
  - [[#which-key][WHICH-KEY]]
- [[#bookmarks-and-buffers][BOOKMARKS AND BUFFERS]]
- [[#dired][DIRED]]
- [[#elfeed][ELFEED]]
- [[#evaluate-elisp-expressions][EVALUATE ELISP EXPRESSIONS]]
- [[#fonts][FONTS]]
- [[#ivy][IVY]]
- [[#line-settings][LINE SETTINGS]]
- [[#manpages][MANPAGES]]
- [[#mastodon][MASTODON]]
- [[#neotree][NEOTREE]]
- [[#open-specific-files][OPEN SPECIFIC FILES]]
- [[#org-mode][ORG MODE]]
- [[#registers][REGISTERS]]
- [[#shells][SHELLS]]
- [[#splits][SPLITS]]
- [[#sublimity][SUBLIMITY]]
- [[#winner-mode][WINNER MODE]]
- [[#pdf][PDF]]
- [[#frog-jump-buffer][Frog-Jump-Buffer]]
- [[#modified-window-splits][Modified window splits]]
- [[#exwm][EXWM]]
  - [[#prepare-setup][Prepare Setup]]
  - [[#initialize-the-actual-wm][Initialize the actual WM]]
  - [[#helm-exwm][HELM-EXWM]]
  - [[#additional-key-configurations][Additional Key Configurations]]
  - [[#desktop-environment][Desktop Environment]]
- [[#telegram][Telegram]]
- [[#elfeed-1][Elfeed]]
- [[#misc-1][MISC]]
  - [[#extract-system-variables][Extract system variables]]
- [[#python-environemt][PYTHON ENVIRONEMT]]
- [[#other-languages][Other languages]]

* ABOUT THIS CONFIG
This is my personal Doom Emacs config.  Doom Emacs is a distribution of Emacs that uses the "evil" keybindings (Vim keybindings) and includes a number of nice extensions and a bit of configuration out of the box.  I am maintaing this config not just for myself, but also for those that want to explore some of what is possible with Emacs.  I will add a lot of examples of plugins and settings, some of them I may not even use personally.  I do this because many people following me on YouTube look at my configs as "documentation".

* MISC
Here we do some very small quality of life fixes
** Add Extra Leader
We set control space to an extra leader.
#+begin_src emacs-lisp
(map! :map general-override-mode-map
    :n " C-SPC" #'doom/leader
    :ei "C-SPC" #'doom/leader)

(map! :map general-override-mode-map
    :n " M-SPC" #'doom/leader
    :ei "M-SPC" #'doom/leader)
#+end_src

** WORDS in Emacs

By default Emacs doesn't consider underscores to be word-characters. We change this to make evil-mode feel more like *vim*.
#+BEGIN_SRC emacs-lisp
    ;; Consider _ as a word-character
    (modify-syntax-entry ?_ "w")
#+END_SRC

** Linenumbers

** Disabling Doom Theme and using Emacs NANO
#+begin_src emacs-lisp
;; (setq doom-theme 'nil)
;; (require 'disp-table)
;; (require 'nano-theme-dark)
;; (require 'nano-help)
;; (require 'nano-modeline)
;; (require 'nano-layout)
#+end_src


** DOOM THEME
Allows us to change emacs theme using <Leader> h t
#+BEGIN_SRC emacs-lisp
(setq doom-theme 'doom-city-lights)

(map! :leader
      :desc "Load new theme"
      "h t" 'counsel-load-theme)
#+END_SRC


** AUTO-FILL
Auto-fill is a god-damn scourge. Lets disable it globally.

#+begin_src emacs-lisp
    (turn-off-auto-fill)
#+end_src

** WHICH-KEY Mode Line Fix
    For some reason the doom mode-line sometimes covers the lower row of the which-key buffer (for certain settings).
    This setting fixes the problem to some extent by adding an extra line worth of height to the which-key buffer.

#+begin_src emacs-lisp :tangle yes
    ;; Add an extra line to work around bug in which-key imprecise
    (defun add-which-key-line (f &rest r) (progn (apply f (list (cons (+ 1 (car (car r))) (cdr (car r)))))))
    (advice-add 'which-key--show-popup :around #'add-which-key-line)
#+end_src

* LINE SETTINGS
Disable line numbers by default.
Doom by default uses 'SPC t l' for changing between line styles.
Use 'SPC t t' for toggle-truncate-lines.

#+BEGIN_SRC emacs-lisp
(setq display-line-numbers-type nil)
(setq display-line-numbers nil)

(map! :leader
      :desc "Toggle truncate lines"
      "t t" 'toggle-truncate-lines)
#+END_SRC

* BOOKMARKS AND BUFFERS
Doom Emacs uses 'SPC b' for keybindings related to bookmarks and buffers.  Bookmarks are somewhat like registers in that they record positions you can jump to.  Unlike registers, they have long names, and they persist automatically from one Emacs session to the next. The prototypical use of bookmarks is to record where you were reading in various files.  Regarding /buffers/, the text you are editing in Emacs resides in an object called a /buffer/. Each time you visit a file, a buffer is used to hold the file’s text. Each time you invoke Dired, a buffer is used to hold the directory listing.

#+BEGIN_SRC emacs-lisp
(map! :leader
      :desc "List bookmarks"
      "b L" 'list-bookmarks
      :leader
      :desc "Save current bookmarks to bookmark file"
      "b w" 'bookmark-save)
#+END_SRC

* DIRED
Dired is the file manager within Emacs.  Below, I setup keybindings for image previews (peep-dired).  Doom Emacs does not use 'SPC d' for any of its keybindings, so I've chosen the format of 'SPC d' plus 'key'.

#+BEGIN_SRC emacs-lisp
(map! :leader
      (:prefix ("d" . "dired")
        :desc "Dired open" "d" 'dired
        :desc "Dired jump to current" "j" 'dired-jump
        (:mode dired
            (:map dired-mode-map
                (:prefix ("n" . "narrow")
                    :desc "Narrow (default)" "n" 'dired-narrow
                    :desc "Narrow (regex)" "r" 'dired-narrow-regexp
                    :desc "Narrow (fuzzy)" "f" 'dired-narrow-fuzzy)
                :desc "Peep-dired" "p" 'peep-dired
                :desc "Dired view file" "v" 'dired-view-file))))

#+END_SRC

Adds support for navigation when inspecting (peeping) files.
#+begin_src emacs-lisp
(evil-define-key 'normal peep-dired-mode-map (kbd "j") 'peep-dired-next-file
  (kbd "k") 'peep-dired-prev-file)
;; Idk why but these things seem necessary

(add-hook 'peep-dired-hook 'evil-normalize-keymaps)
#+end_src


Dired-subtree enables expanding directories. These keybindings attempts emulate org-mode's way of showing headlines.
#+begin_src emacs-lisp

;; Add support for inserting the sub-tree
(evil-define-key 'normal dired-mode-map (kbd "<tab>" ) 'dired-subtree-insert
  (kbd "<backtab>") 'dired-subtree-remove
  (kbd "C-<tab>") 'dired-subtree-cycle
  (kbd "C-c f") 'luklun/dired-subtree-insert-full-tree)

;; Idk why but these things seem necessary
(add-hook 'dired-subtree-hook 'evil-normalize-keymaps)
#+end_src

* ELFEED
An RSS newsfeed reader for Emacs.

#+BEGIN_SRC emacs-lisp
(custom-set-variables
 '(elfeed-feeds
   (quote
    (("https://www.reddit.com/r/linux.rss" reddit linux)
     ("https://www.gamingonlinux.com/article_rss.php" gaming linux)
     ("https://hackaday.com/blog/feed/" hackaday linux)
     ("https://opensource.com/feed" opensource linux)
     ("https://linux.softpedia.com/backend.xml" softpedia linux)
     ("https://itsfoss.com/feed/" itsfoss linux)
     ("https://www.zdnet.com/topic/linux/rss.xml" zdnet linux)
     ("https://www.phoronix.com/rss.php" phoronix linux)
     ("http://feeds.feedburner.com/d0od" omgubuntu linux)
     ("https://www.computerworld.com/index.rss" computerworld linux)
     ("https://www.networkworld.com/category/linux/index.rss" networkworld linux)
     ("https://www.techrepublic.com/rssfeeds/topic/open-source/" techrepublic linux)
     ("https://betanews.com/feed" betanews linux)
     ("http://lxer.com/module/newswire/headlines.rss" lxer linux)
     ("https://distrowatch.com/news/dwd.xml" distrowatch linux)))))
#+END_SRC

* EVALUATE ELISP EXPRESSIONS
Changing some keybindings from their defaults to better fit with Doom Emacs, and to avoid conflicts with my window managers which sometimes use the control key in their keybindings.  By default, Doom Emacs does not use 'SPC e' for anything, so I choose to use the format 'SPC e' plus 'key' for these (I also use 'SPC e' for 'eww' keybindings).

#+BEGIN_SRC emacs-lisp :tangle yes
(map! :leader
      (:prefix ("e" . "eval")
        :desc "Evaluate elisp in buffer" "b" 'eval-buffer
        :desc "Evaluate defun" "d" 'eval-defun
        :desc "Evaluate elisp expression" "e" 'eval-expression
        :desc "Evaluate last sexpressio" "l" 'eval-last-sexp
        :desc "Evaluate elisp in region"  "r" 'eval-region
        (:prefix ("o" . "org")
          :desc "Evaluate org subtree" "s" 'org-babel-execute-src-block
          :desc "Evaluate org buffer" "e" 'org-babel-execute-buffer
          :desc "Evaluate org code block" "b" 'org-babel-execute-src-block)))
#+END_SRC

* FONTS
Settings related to fonts within Doom Emacs:
+ 'doom-font' -- standard monospace font that is used for most things in Emacs.
+ 'doom-variable-pitch-font' -- variable font which is useful in some Emacs plugins.
+ 'doom-big-font' -- used in doom-big-font-mode; useful for presentations.
+ 'font-lock-comment-face' -- for comments.
+ 'font-lock-keyword-face' -- for keywords with special significance, like ‘for’ and ‘if’ in C.

#+BEGIN_SRC emacs-lisp
(setq doom-font (font-spec :family "RobotoMono" :size 12))
(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))

(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))
#+END_SRC

* IVY
Ivy is a generic completion mechanism for Emacs.  By default, Doom Emacs does not use 'SPC v', so the format I use for these bindings is 'SPC v' plus 'key'.

#+BEGIN_SRC emacs-lisp
(map! :leader
      (:prefix ("v" . "ivy")
        :desc "Ivy push view" "p" 'ivy-push-view
        :desc "Ivy switch view" "s" 'ivy-switch-view))
#+END_SRC

# ivy-posframe allows us to add floating windows

# #+begin_src emacs-lisp :tangle yes

# (require 'ivy-posframe)
# (after! ivy-posframe
#   (setq ivy-posframe-display-functions-alist
#       '((counsel-linux-app     . ivy-posframe-display-at-frame-center)
#         (nil               . ivy-posframe-display)))
#   (setq ivy-posframe-parameters
#       '((left-fringe . 8)
#         (right-fringe . 8)))
#   (setq ivy-posframe-width 150
#       ivy-posframe-height 30)
#   (setq ivy-posframe-parameters '((parent-frame nil))))

# (defun ivy-posframe-get-size ()
#   "The default functon used by `ivy-posframe-size-function'."
#   (list
#     :height ivy-posframe-height
#     :width ivy-posframe-width))
#     ;; :min-height ivy-posframe-height
#     ;; :min-width ivy-posframe-width))
#    ;; :min-height (or ivy-posframe-min-height (+ ivy-height 1))
#    ;; :min-width (or ivy-posframe-min-width (round (* (frame-width) 0.62)))))

# (ivy-posframe-mode 1)

# (map! :leader
#       (:prefix ("o")
#         :desc "Launch linux exe" "x" 'counsel-linux-app))

#+end_src

* MANPAGES

#+BEGIN_SRC emacs-lisp
(require 'ox-groff)
#+END_SRC

* MASTODON
Mastodon.el is a mastodon client for Emacs.  Note that I wrapped my settings with (after! mastodon).  Without this, my settings for the mastodon instance that I use would be overwritten by the default settings for this module, which is "mastodon.social".

#+BEGIN_SRC emacs-lisp
(after! mastodon
  (setq mastodon-instance-url "https://mastodon.technology/"))
#+END_SRC

