.config/doom/config.el
(map! :map general-override-mode-map
    :n " C-SPC" #'doom/leader
    :ei "C-SPC" #'doom/leader)

(map! :map general-override-mode-map
    :n " M-SPC" #'doom/leader
    :ei "M-SPC" #'doom/leader)

;; Consider _ as a word-character
(modify-syntax-entry ?_ "w")

;; (setq doom-theme 'nil)
;; (require 'disp-table)
;; (require 'nano-theme-dark)
;; (require 'nano-help)
;; (require 'nano-modeline)
;; (require 'nano-layout)

(setq doom-theme 'doom-city-lights)

(map! :leader
      :desc "Load new theme"
      "h t" 'counsel-load-theme)

(turn-off-auto-fill)

;; Add an extra line to work around bug in which-key imprecise
(defun add-which-key-line (f &rest r) (progn (apply f (list (cons (+ 1 (car (car r))) (cdr (car r)))))))
(advice-add 'which-key--show-popup :around #'add-which-key-line)

(setq display-line-numbers-type nil)
(setq display-line-numbers nil)

(map! :leader
      :desc "Toggle truncate lines"
      "t t" 'toggle-truncate-lines)

(map! :leader
      :desc "List bookmarks"
      "b L" 'list-bookmarks
      :leader
      :desc "Save current bookmarks to bookmark file"
      "b w" 'bookmark-save)

(map! :leader
      (:prefix ("d" . "dired")
        :desc "Dired open" "d" 'dired
        :desc "Dired jump to current" "j" 'dired-jump
        (:mode dired
            (:map dired-mode-map
                (:prefix ("n" . "narrow")
                    :desc "Narrow (default)" "n" 'dired-narrow
                    :desc "Narrow (regex)" "r" 'dired-narrow-regexp
                    :desc "Narrow (fuzzy)" "f" 'dired-narrow-fuzzy)
                :desc "Peep-dired" "p" 'peep-dired
                :desc "Dired view file" "v" 'dired-view-file))))

(evil-define-key 'normal peep-dired-mode-map (kbd "j") 'peep-dired-next-file
  (kbd "k") 'peep-dired-prev-file)
;; Idk why but these things seem necessary

(add-hook 'peep-dired-hook 'evil-normalize-keymaps)

;; Add support for inserting the sub-tree
(evil-define-key 'normal dired-mode-map (kbd "<tab>" ) 'dired-subtree-insert
  (kbd "<backtab>") 'dired-subtree-remove
  (kbd "C-<tab>") 'dired-subtree-cycle
  (kbd "C-c f") 'luklun/dired-subtree-insert-full-tree)

;; Idk why but these things seem necessary
(add-hook 'dired-subtree-hook 'evil-normalize-keymaps)

(custom-set-variables
 '(elfeed-feeds
   (quote
    (("https://www.reddit.com/r/linux.rss" reddit linux)
     ("https://www.gamingonlinux.com/article_rss.php" gaming linux)
     ("https://hackaday.com/blog/feed/" hackaday linux)
     ("https://opensource.com/feed" opensource linux)
     ("https://linux.softpedia.com/backend.xml" softpedia linux)
     ("https://itsfoss.com/feed/" itsfoss linux)
     ("https://www.zdnet.com/topic/linux/rss.xml" zdnet linux)
     ("https://www.phoronix.com/rss.php" phoronix linux)
     ("http://feeds.feedburner.com/d0od" omgubuntu linux)
     ("https://www.computerworld.com/index.rss" computerworld linux)
     ("https://www.networkworld.com/category/linux/index.rss" networkworld linux)
     ("https://www.techrepublic.com/rssfeeds/topic/open-source/" techrepublic linux)
     ("https://betanews.com/feed" betanews linux)
     ("http://lxer.com/module/newswire/headlines.rss" lxer linux)
     ("https://distrowatch.com/news/dwd.xml" distrowatch linux)))))

(map! :leader
      (:prefix ("e" . "eval")
        :desc "Evaluate elisp in buffer" "b" 'eval-buffer
        :desc "Evaluate defun" "d" 'eval-defun
        :desc "Evaluate elisp expression" "e" 'eval-expression
        :desc "Evaluate last sexpressio" "l" 'eval-last-sexp
        :desc "Evaluate elisp in region"  "r" 'eval-region
        (:prefix ("o" . "org")
          :desc "Evaluate org subtree" "s" 'org-babel-execute-src-block
          :desc "Evaluate org buffer" "e" 'org-babel-execute-buffer
          :desc "Evaluate org code block" "b" 'org-babel-execute-src-block)))

(setq doom-font (font-spec :family "RobotoMono" :size 12))
(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))

(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))

(map! :leader
      (:prefix ("v" . "ivy")
        :desc "Ivy push view" "p" 'ivy-push-view
        :desc "Ivy switch view" "s" 'ivy-switch-view))

(require 'ox-groff)

(after! mastodon
  (setq mastodon-instance-url "https://mastodon.technology/"))

(after! neotree
