.config/doom/config.org
** Initialize the actual WM
#+begin_src emacs-lisp :tangle yes
  (use-package exwm
    :config
    ;; Set the default number of workspaces
    (setq exwm-workspace-number 10)

    ;; When window "class" updates, use it to set the buffer name
    (add-hook 'exwm-update-class-hook #'efs/exwm-update-class)

    ;; When EXWM starts up, do some extra confifuration
    (add-hook 'exwm-init-hook #'efs/exwm-init-hook)

    ;; Rebind CapsLock to Ctrl
    (start-process-shell-command "xmodmap" nil "xmodmap ~/.emacs.d/exwm/Xmodmap")

    ;; Set the screen resolution (update this to be the correct resolution for your screen!)
    ;; (require 'exwm-randr)
    ;; (exwm-randr-enable)
    ;; (start-process-shell-command "xrandr" nil "xrandr --output Virtual-1 --primary --mode 2048x1152 --pos 0x0 --rotate normal")

    ;; Set the wallpaper after changing the resolution
    (efs/set-wallpaper)

    ;; Load the system tray before exwm-init
    ;; (require 'exwm-systemtray)
    ;; (setq exwm-systemtray-height 32)
    ;; (exwm-systemtray-enable)

    ;; These keys should always pass through to Emacs
    (setq exwm-input-prefix-keys
      '(?\C-x
        ?\C-u
        ?\C-h
        ?\M-x
        ?\M-`
        ?\M-\
        ?\M-&
        ?\M-:
        ?\C-\M-j  ;; Buffer list
        ?\C-\ ;; Ctrl+Space
        ?\ ;; Ctrl+Space
    ))

    ;; Ctrl+Q will enable the next key to be sent directly
    (define-key exwm-mode-map [?\C-q] 'exwm-input-send-next-key)

    ;; Set up global key bindings.  These always work, no matter the input state!
    ;; Keep in mind that changing this list after EXWM initializes has no effect.
    (setq exwm-input-global-keys
          `(
            ;; Reset to line-mode (C-c C-k switches to char-mode via exwm-input-release-keyboard)
            ([?\s-r] . exwm-reset)

            ;; Move between windows
            ([s-left] . windmove-left)
            ([s-right] . windmove-right)
            ([s-up] . windmove-up)
            ([s-down] . windmove-down)

            ([?\s-h] . evil-window-left)
            ([?\s-j] . evil-window-down)
            ([?\s-k] . evil-window-up)
            ([?\s-l] . evil-window-right)

            ;; Kill buffer
            ([?\s-q] . kill-this-buffer)
            ([?\s-Q] . +workspace/close-window-or-workspace)

            ;; Move windows
            ([?\s-H] . +evil/window-move-left)
            ([?\s-J] . +evil/window-move-down)
            ([?\s-K] . +evil/window-move-up)
            ([?\s-L] . +evil/window-move-right)
            ;; move window to far left or far right with SUPER+CTRL+h,l
            ([?\s-\C-h] . side-left-window)
            ([?\s-\C-j] . side-bottom-window)
            ([?\s-\C-l] . side-right-window)
            ([?\s-\C-d] . side-window-delete-all)
            ([?\s-\C-r] . resize-window)

            ;; Launch applications via shell command
            ([?\s-&] . (lambda (command)
                         (interactive (list (read-shell-command "$ ")))
                         (start-process-shell-command command nil command)))
            ;; move window workspace with SUPER+SHIFT+{0-9}
            ;; Switch workspace
            ([?\s-w] . exwm-workspace-switch)
            ([?\s-`] . (lambda () (interactive) (exwm-workspace-switch-create 0)))

            ([?\s-v] . +evil/vsplit-follow)
            ([?\s-z] . +evil/split-follow)
            ;; managing workspaces
            ([?\s-w] . exwm-workspace-switch)
            ([?\s-W] . exwm-workspace-swap)

            ;; Toggle between line and char mode
            ([?\s-e] . exwm-input-toggle-keyboard)
            ([?\s-/] . exwm-input-release-keyboard)
            ([?\s-?] . exwm-reset)
            ;; setting some toggle commands
            ([?\s-f] . exwm-floating-toggle-floating)
            ([?\s-m] . exwm-layout-toggle-mode-line)
            ([f11] . exwm-layout-toggle-fullscreen)

            ;; TODr There has to be a better way of doing this
            ;; move window workspace with SUPER+SHIFT+{0-9}
            ([?\s-\)] . (lambda () (interactive) (exwm-workspace-move-window 0)))
            ([?\s-!] . (lambda () (interactive) (exwm-workspace-move-window 1)))
            ([?\s-@] . (lambda () (interactive) (exwm-workspace-move-window 2)))
            ([?\s-#] . (lambda () (interactive) (exwm-workspace-move-window 3)))
            ([?\s-$] . (lambda () (interactive) (exwm-workspace-move-window 4)))
            ([?\s-%] . (lambda () (interactive) (exwm-workspace-move-window 5)))
            ([?\s-^] . (lambda () (interactive) (exwm-workspace-move-window 6)))
            ([?\s-&] . (lambda () (interactive) (exwm-workspace-move-window 7)))
            ([?\s-*] . (lambda () (interactive) (exwm-workspace-move-window 8)))
            ([?\s-\(] . (lambda () (interactive) (exwm-workspace-move-window 9)))
            ;; 's-N': Switch to certain workspace with Super (Win) plus a number key (0 - 9)
            ,@(mapcar (lambda (i)
                        `(,(kbd (format "s-%d" i)) .
                          (lambda ()
                            (interactive)
                            (exwm-workspace-switch-create ,i))))
                      (number-sequence 0 9))))




    ;; Enable char mode by default in all exwm buffers
    (setq exwm-manage-configurations '((t char-mode t)))
    (exwm-enable))
    #+end_src

** HELM-EXWM
This nifty little thing allows us to iterate over all active X-window buffers and display it in the current window.
#+begin_src emacs-lisp
(use-package helm-exwm
  :config
  (setq exwm-layout-show-all-buffers t)
  (setq helm-exwm-emacs-buffers-source (helm-exwm-build-emacs-buffers-source))
  (setq helm-exwm-source (helm-exwm-build-source))
  (setq helm-mini-default-sources `(helm-exwm-emacs-buffers-source
                                    helm-exwm-source
                                    helm-source-recentf)))

#+end_src
** Additional Key Configurations
We define some additional useful keybindings for launching applications and managing active x-windows.
#+begin_src emacs-lisp
    (exwm-input-set-key (kbd "s-d") 'counsel-linux-app)
    ;; Launch the application in a new window
    (exwm-input-set-key (kbd "s-D") '+exwm/counsel-linux-app-new-window)
    ;; List active x-window buffers with helm
    (exwm-input-set-key (kbd "s-x") 'helm-exwm)
#+end_src

** Desktop Environment
The desktop-environment package pre-defines some functionality that is useful for interacting with the operating system.
We, however, do not want to enable the global minor mode, since this will overwrite some of our keys.
Instead, we set our own key configurations.
#+begin_src emacs-lisp

(use-package desktop-environment
  :after exwm

  :config
  (exwm-input-set-key (kbd "<s-f6>") 'desktop-environment-brightness-increment)
  (exwm-input-set-key (kbd "<s-f5>") 'desktop-environment-brightness-decrement)
  (exwm-input-set-key (kbd "<s-f12>") 'desktop-environment-volume-increment)
  (exwm-input-set-key (kbd "s-.") 'desktop-environment-volume-increment)
  (exwm-input-set-key (kbd "<s-f11>") 'desktop-environment-volume-decrement)
  (exwm-input-set-key (kbd "s-,") 'desktop-environment-volume-decrement)
  (exwm-input-set-key (kbd "<s-f10>") 'desktop-environment-toggle-mute)
  (exwm-input-set-key (kbd "s-b") 'desktop-environment-toggle-mute)
  (exwm-input-set-key (kbd "s-C-p") 'desktop-environment-lock-screen)
  (exwm-input-set-key (kbd "s-C-b") 'desktop-environment-toggle-bluetooth)
  :custom
  (desktop-environment-brightness-small-increment "2%+")
  (desktop-environment-brightness-small-decrement "2%-")
  (desktop-environment-brightness-normal-increment "5%+")
  (desktop-environment-brightness-normal-decrement "5%-"))

#+end_src

* Telegram
    #+begin_src emacs-lisp
    (use-package telega
    :commands telega
    :config
    (setq telega-use-tracking-for nil))
    #+end_src


* Elfeed

#+begin_src emacs-lisp
(use-package elfeed
  :commands elfeed
  :config
  (setq elfeed-feeds
    '("https://nullprogram.com/feed/"
        "https://ambrevar.xyz/atom.xml"
        "https://guix.gnu.org/feeds/blog.atom"
        "https://valdyas.org/fading/feed/"
        "https://www.reddit.com/r/emacs/.rss"
        "https://nitter.net/chris_af_VP/rss"
        "https://nitter.net/hanifbali/rss"
        "https://www.youtube.com/feeds/videos.xml?channel_id=UC2eYFnH61tmytImy1mTYvhA"
        "https://www.youtube.com/feeds/videos.xml?channel_id=UCVls1GmFKf6WlTraIb_IaJg")))
#+end_src


* MISC
