.config/doom/config.org
** Extract system variables
#+begin_src emacs-lisp
(use-package! exec-path-from-shell
    :config
        ;; Load the
        (when (memq window-system '(mac ns x))
        (exec-path-from-shell-initialize))
        ;; Load the shell path when running as a daemon
        (when (daemonp)
        (exec-path-from-shell-initialize)))
#+end_src


# ** Let tramp use remote path
# #+begin_src emacs-lisp
# (add-to-list 'tramp-remote-path 'tramp-own-remote-path)
# #+end_src

* PYTHON ENVIRONEMT
#+begin_src emacs-lisp
(use-package pyvenv
  :ensure t
  :config
  (pyvenv-mode t)

  ;; Set correct Python interpreter
  (setq pyvenv-post-activate-hooks
        (list (lambda ()
                (setq python-shell-interpreter (concat pyvenv-virtual-env "bin/python3")))))
  (setq pyvenv-post-deactivate-hooks
        (list (lambda ()
                (setq python-shell-interpreter "python3")))))

#+end_src


Python LSP over tramp
#+begin_src emacs-lisp
;; Use the microsoft server because it is faster
(use-package lsp-python-ms
  :ensure t
  :init (setq lsp-python-ms-auto-install-server t)
  :hook (python-mode . (lambda ()
                          (require 'lsp-python-ms)
                          (lsp))))  ; or lsp-deferred

(lsp-register-client
    (make-lsp-client :new-connection (lsp-tramp-connection "pyls")
                     :major-modes '(python-mode)
                     :remote? t
                     :server-id 'pyls-remote))

#+end_src


* Other languages

Add support for Vue development
#+begin_src emacs-lisp
(use-package vue-mode)
#+end_src

* Testing

#+begin_src emacs-lisp
(use-package! eaf
  :config
  (require 'eaf-evil)
  (setq eaf-browser-continue-where-left-off t)
  (setq eaf-evil-leader-key "SPC"))
#+end_src
