.config/doom/config.el

(use-package! exec-path-from-shell
    :config
        ;; Load the
        (when (memq window-system '(mac ns x))
        (exec-path-from-shell-initialize))
        ;; Load the shell path when running as a daemon
        (when (daemonp)
        (exec-path-from-shell-initialize)))

(use-package pyvenv
  :ensure t
  :config
  (pyvenv-mode t)

  ;; Set correct Python interpreter
  (setq pyvenv-post-activate-hooks
        (list (lambda ()
                (setq python-shell-interpreter (concat pyvenv-virtual-env "bin/python3")))))
  (setq pyvenv-post-deactivate-hooks
        (list (lambda ()
                (setq python-shell-interpreter "python3")))))

;; Use the microsoft server because it is faster
(use-package lsp-python-ms
  :ensure t
  :init (setq lsp-python-ms-auto-install-server t)
  :hook (python-mode . (lambda ()
                          (require 'lsp-python-ms)
                          (lsp))))  ; or lsp-deferred

(lsp-register-client
    (make-lsp-client :new-connection (lsp-tramp-connection "pyls")
                     :major-modes '(python-mode)
                     :remote? t
                     :server-id 'pyls-remote))

(use-package vue-mode)

(use-package! eaf
  :config
  (require 'eaf-evil)
  (setq eaf-browser-continue-where-left-off t)
  (setq eaf-evil-leader-key "SPC"))
